name_BOT="BOTанатор"
print("Привет меня зовут ",name_BOT)
name_me = input("Как вас зовут: ")
print("Приятно познакомиться,", name_me)
age = int(input("Сколько тебе лет?"))
print("Круто а,через 10 лет тебе будет", age+10)
height = float(input("твой рост?Например мой:0.68 "))
print("Ого!Ты выше меня на ",height-0.68,"метров")
print("Мне приятно познакомиться:",name_me,age,"лет.С ростом:",height,"метров!")


anecdotes = input("Какую шутку тебе рассказать?(1,2,3)")
if anecdotes == "1":
    print("– Хочешь чаю?","\n","– Нет, спасибо, я уже отчаялся.")
elif anecdotes == "2":
    print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
    "- ВОДА!!!ВОДА!!!","\n",
    "Вдруг из колодца вылезает голова и говорит:","\n",
    "- ГДЕ????????????????????")
else:
    print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это             спамеры или мошенники, а не с работы, сразу расслабляюсь. От мошенников      хотя бы понятно, что ожидать.")

  
question = input("хочешь еще анекдот?(1,2)")
if question == "1":
    shutka = input("Какую шутку тебе рассказать?(1,2,3)")
if shutka == "1":
    print("– Хочешь чаю?","\n",
    "– Нет, спасибо, я уже отчаялся.")
elif shutka == "2":
    print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
    "- ВОДА!!!ВОДА!!!","\n",
    "Вдруг из колодца вылезает голова и говорит:","\n",
    "- ГДЕ????????????????????")
else:
    print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это               спамеры или мошенники, а не с работы, сразу расслабляюсь. От                   мошенников хотя бы понятно, что ожидать.")

question2 = input("хочешь еще анекдот?(1,2)")
if question2 == "1":
    mockery = input("Какую шутку тебе рассказать?(1,2,3)")
if mockery == "1":
    print("– Хочешь чаю?","\n",
    "– Нет, спасибо, я уже отчаялся.")
elif mockery == "2":
    print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
    "- ВОДА!!!ВОДА!!!","\n",
    "Вдруг из колодца вылезает голова и говорит:","\n",
    "- ГДЕ????????????????????")
else:
    print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это               спамеры или мошенники, а не с работы, сразу расслабляюсь. От                   мошенников хотя бы понятно, что ожидать.")
