name="BOTанатор"
print("Привет меня зовут "+name)
name2 = input("Как вас зовут: ")
print("Приятно познакомиться,", name2)
age = int(input("Сколько тебе лет?"))
print("Круто а,через 10 лет тебе будет", age+10)
long = float(input("твой рост?Например мой:0.68 "))
print("Ого!Ты выше меня на ",long-0.68,"метров")
print("Мне приятно познакомиться:",name2,age,"лет.С ростом:",long," метров!")


shutka = input("Какую шутку тебе рассказать?(1,2,3)")
if shutka == "1":
  print("– Хочешь чаю?","\n",
  "– Нет, спасибо, я уже отчаялся.")
elif shutka == "2":
  print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
"- ВОДА!!!ВОДА!!!","\n",
"Вдруг из колодца вылезает голова и говорит:","\n",
"- ГДЕ????????????????????")
else:
  print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это спамеры или мошенники, а не с работы, сразу расслабляюсь. От мошенников хотя бы понятно, что ожидать.")

  
shutka2 = input("хочешь еще анекдот?(1,2)")
if shutka2 == "1":
    shutka3 = input("Какую шутку тебе рассказать?(1,2,3)")
    if shutka3 == "1":
      print("– Хочешь чаю?","\n",
    "– Нет, спасибо, я уже отчаялся.")
    elif shutka3 == "2":
      print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
      "- ВОДА!!!ВОДА!!!","\n",
      "Вдруг из колодца вылезает голова и говорит:","\n",
      "- ГДЕ????????????????????")
    else:
      print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это            спамеры или мошенники, а не с работы, сразу расслабляюсь. От                 мошенников хотя бы понятно, что ожидать.")

shutka4 = input("хочешь еще анекдот?(1,2)")
if shutka4 == "1":
    shutka5 = input("Какую шутку тебе рассказать?(1,2,3)")
    if shutka5 == "1":
      print("– Хочешь чаю?","\n",
    "– Нет, спасибо, я уже отчаялся.")
    elif shutka5 == "2":
      print("Идет мужик по пустыни... Видит колодец... Кричит:","\n",
      "- ВОДА!!!ВОДА!!!","\n",
      "Вдруг из колодца вылезает голова и говорит:","\n",
      "- ГДЕ????????????????????")
    else:
      print("Неожиданно понял⁠⁠, что когда мне звонят, и я вижу, что это            спамеры или мошенники, а не с работы, сразу расслабляюсь. От                мошенников хотя бы понятно, что ожидать.")
